package com.etco.enums;

/**
 * テキストリソース役割
 * <pre>
 * 追加や変更の場合は必ずTextResourcesService 内のUpdateも合わせて修正
 * </pre>
 * @author takahara
 *
 */
public enum TextResIds {
    T001_INDEX_001("Kaleidoscope Media Service")
    ,T001_INDEX_002("キャッチ的なテキストが入ります")
    ,T001_INDEX_003("SERVICE")
    ,T001_INDEX_004("インターネット広告や紙媒体、モバイル端末向けの媒体販促ツールなどを含め広告にまつわるデザイン制作も請負い、プロモーションの全てを引き受け案件進行を行っております。 広告については成果検証を行い、クライアント様を必ずや成功に導くお手伝いをさせていただきます。")
    ,T001_INDEX_005("NEWS")
    ,T001_INDEX_090("ABOUT US")
    ,T001_INDEX_091("株式会社KMSのホームページにアクセス頂きありがとうございます。\n\n当社は広告代理業務を行う、メディアプランナー企業です。\n私達は、インターネットというフィールドをフル活用し、 ”より便利な社会を創造したい” という思いを実行するために、サービスを企画し、会社全体で取り組んで行く事で、 弊社に関わる全ての方に必要とされるような会社を目指しています。 社員一同、全力を尽くして取り組みますので今後ともご一層のご支援ご鞭撻くださいますよう、どうぞよろしくお願い致します。")
    ,T001_INDEX_092("COMPANY")
    ,T001_ABOUT_090("ABOUT US")
    ,T001_ABOUT_091("株式会社KMSのホームページにアクセス頂きありがとうございます。\n\n当社は広告代理業務を行う、メディアプランナー企業です。\n私達は、インターネットというフィールドをフル活用し、 ”より便利な社会を創造したい” という思いを実行するために、サービスを企画し、会社全体で取り組んで行く事で、 弊社に関わる全ての方に必要とされるような会社を目指しています。 社員一同、全力を尽くして取り組みますので今後ともご一層のご支援ご鞭撻くださいますよう、どうぞよろしくお願い致します。")
    ,T001_ABOUT_092("COMPANY")
    ,T001_NEWS_090("ABOUT US")
    ,T001_NEWS_091("株式会社KMSのホームページにアクセス頂きありがとうございます。\n\n当社は広告代理業務を行う、メディアプランナー企業です。\n私達は、インターネットというフィールドをフル活用し、 ”より便利な社会を創造したい” という思いを実行するために、サービスを企画し、会社全体で取り組んで行く事で、 弊社に関わる全ての方に必要とされるような会社を目指しています。 社員一同、全力を尽くして取り組みますので今後ともご一層のご支援ご鞭撻くださいますよう、どうぞよろしくお願い致します。")
    ,T001_NEWS_092("COMPANY")
    ,T001_SERVICE_001("キャッチ的なテキストが入ります")
    ,T001_SERVICE_002("インターネット広告や紙媒体、モバイル端末向けの媒体販促ツールなどを含め広告にまつわるデザイン制作も請負い、プロモーションの全てを引き受け案件進行を行っております。 広告については成果検証を行い、クライアント様を必ずや成功に導くお手伝いをさせていただきます。")
    ,T001_SERVICE_003("タイトル")
    ,T001_SERVICE_004("KMSが目指すゴールを 達成する為の基本的なルールです。 このルールを守り、社員一人一人が自主的・主体的に動いて、大きなゴールを目指します。")
    ,T001_SERVICE_090("ABOUT US")
    ,T001_SERVICE_091("株式会社KMSのホームページにアクセス頂きありがとうございます。\n\n当社は広告代理業務を行う、メディアプランナー企業です。\n私達は、インターネットというフィールドをフル活用し、 ”より便利な社会を創造したい” という思いを実行するために、サービスを企画し、会社全体で取り組んで行く事で、 弊社に関わる全ての方に必要とされるような会社を目指しています。 社員一同、全力を尽くして取り組みますので今後ともご一層のご支援ご鞭撻くださいますよう、どうぞよろしくお願い致します。")
    ,T001_SERVICE_092("COMPANY")
    ,T001_CONTACT_001("ご不明な点ございましたら、お気軽にお問い合わせください")
    ,T001_CONTACT_002("Contact info")
    ,T001_CONTACT_090("ABOUT US")
    ,T001_CONTACT_091("株式会社KMSのホームページにアクセス頂きありがとうございます。\n\n当社は広告代理業務を行う、メディアプランナー企業です。\n私達は、インターネットというフィールドをフル活用し、 ”より便利な社会を創造したい” という思いを実行するために、サービスを企画し、会社全体で取り組んで行く事で、 弊社に関わる全ての方に必要とされるような会社を目指しています。 社員一同、全力を尽くして取り組みますので今後ともご一層のご支援ご鞭撻くださいますよう、どうぞよろしくお願い致します。")
    ,T001_CONTACT_092("COMPANY")
    ,T001_LIST_ITEM_TYPE001_001("サービス詳細")
    ,T001_LIST_ITEM_TYPE001_002("サービスの簡易説明テキスト等入りますサービスの簡易説明テキスト等入ります")
    ,T001_LIST_ITEM_TYPE002_001("お知らせタイトル")
    ,T001_LIST_ITEM_TYPE002_002("お知らせ詳細が入りますお知らせ詳細が入りますお知らせ詳細が入りますお知らせ詳細が入りますお知らせ詳細が入りますお知らせ詳細が入りますお知らせ詳細が入りますお知らせ詳細が入りますお知らせ詳細が入りますお知らせ詳細が入りますお知らせ詳細が入りますお知らせ詳細が入りますお知らせ詳細が入りますお知らせ詳細が入りますお知らせ詳細が入ります")
    ,T001_LIST_ITEM_TYPE003_001("デザイン企画・制作")
    ,T001_LIST_ITEM_TYPE003_002("サービスの簡易説明テキスト等入りますサービスの簡易説明テキスト等入ります")
    // テンプレート２
    ,T002_INDEX_001("Kaleidoscope Media Service")
    ,T002_INDEX_002("キャッチ的なテキストが入ります")
    ,T002_INDEX_003("サービス")
    ,T002_INDEX_004("インターネット広告や紙媒体、モバイル端末向けの媒体販促ツールなどを含め広告にまつわるデザイン制作も請負い、プロモーションの全てを引き受け案件進行を行っております。 広告については成果検証を行い、クライアント様を必ずや成功に導くお手伝いをさせていただきます。")
    ,T002_INDEX_005("お知らせ")
    ,T002_NEWS_001("お知らせ")
    ,T002_SERVICE_001("サービス")
    ,T002_SERVICE_002("インターネット広告や紙媒体、モバイル端末向けの媒体販促ツールなどを含め広告にまつわるデザイン制作も請負い、プロモーションの全てを引き受け案件進行を行っております。 広告については成果検証を行い、クライアント様を必ずや成功に導くお手伝いをさせていただきます。")
    ,T002_SERVICE_003("タイトル")
    ,T002_SERVICE_004("サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細サービス詳細")
    ,T002_CONTACT_001("お問い合わせ")
    ,T002_CONTACT_002("ご不明な点ございましたらお気軽にお問い合わせください。")
    ,T002_ABOUT_001("会社情報")
    ,T002_ABOUT_002("COMPANY")
    ,T002_LIST_ITEM_TYPE001_001("サービス詳細")
    ,T002_LIST_ITEM_TYPE001_002("サービスの簡易説明テキスト等入りますサービスの簡易説明テキスト等入ります")
    ,T002_LIST_ITEM_TYPE002_001("お知らせタイトル")
    ,T002_LIST_ITEM_TYPE002_002("お知らせ詳細お知らせ詳細お知らせ詳細")
    ,T002_LIST_ITEM_TYPE003_001("デザイン企画・制作")
    ,T002_LIST_ITEM_TYPE003_002("サービスの簡易説明テキスト等入りますサービスの簡易説明テキスト等入ります")
    
    ;
    
    private String defaultValue;
    
    private TextResIds(String defaultValue) {
        this.setDefaultValue(defaultValue);
    }

    public String getDefaultValue() {
        return defaultValue;
    }

    public void setDefaultValue(String defaultValue) {
        this.defaultValue = defaultValue;
    }
}
